Data Frames parte 3

In [1]:
import numpy as np

In [2]:
import pandas as pd

Niveles de indeces

In [3]:
afuera = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [4]:
adentro = [1,2,3,1,2,3]

In [7]:
indices = list(zip(afuera, adentro))

In [8]:
indices

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [9]:
indices = pd.MultiIndex.from_tuples(indices)

In [10]:
indices

MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [11]:
type(indices)

pandas.indexes.multi.MultiIndex

In [13]:
from numpy.random import randn

In [14]:
df = pd.DataFrame(randn(6,2), indices, ['A','B'])

In [15]:
df

             A         B
G1 1 -1.475597  0.892355
   2  0.149624  0.473939
   3  0.155570 -2.626694
G2 1 -0.306110 -0.980007
   2  0.246938 -0.713850
   3  0.207603 -0.995901

In [17]:
df.loc['G1'].loc[1]

A   -1.475597
B    0.892355
Name: 1, dtype: float64

In [18]:
df.loc['G2'].loc[3]

A    0.207603
B   -0.995901
Name: 3, dtype: float64

In [20]:
df.loc['G2'].loc[2]['B']

-0.71384979957075345

Metodo Sección cruzada

In [27]:
df.xs('G1')

          A         B
1 -1.475597  0.892355
2  0.149624  0.473939
3  0.155570 -2.626694

In [39]:
df.xs(1, level=1)

           A         B
G1 -1.475597  0.892355
G2 -0.306110 -0.980007

Datos perdidos

In [40]:
import numpy as np

In [41]:
import pandas as pd

In [42]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [43]:
df = pd.DataFrame(d)

In [44]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [47]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [48]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [57]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [59]:
df.fillna(value="rellenar")

          A         B  C
0         1         5  1
1         2  rellenar  2
2  rellenar  rellenar  3

In [60]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [65]:
df['A'].fillna(value=df['A'].mean(), inplace=True)

In [66]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

Agrupar alias GroupBy

In [70]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person': ['Sam', 'Jose', 'Amy', 'Ray', 'Carl', 'Christian'],
        'Sales': [200,120,340,124,243,350]}

In [72]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Jose', 'Amy', 'Ray', 'Carl', 'Christian'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [73]:
df = pd.DataFrame(data)

In [74]:
df

  Company     Person  Sales
0    GOOG        Sam    200
1    GOOG       Jose    120
2    MSFT        Amy    340
3    MSFT        Ray    124
4      FB       Carl    243
5      FB  Christian    350

In [79]:
df.groupby('Company')

In [76]:
byCom = df.groupby('Company')

In [80]:
byCom.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [82]:
byCom.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [83]:
byCom.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [84]:
byCom.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [85]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [86]:
df.groupby('Company').max()

            Person  Sales
Company
FB       Christian    350
GOOG           Sam    200
MSFT           Ray    340

In [87]:
df.groupby('Company').min()

        Person  Sales
Company
FB        Carl    243
GOOG      Jose    120
MSFT       Amy    124

In [88]:
df.groupby('Company').describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [90]:
df.groupby('Company').describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [91]:
df.groupby('Company').describe().transpose()['FB']

       count   mean        std    min     25%    50%     75%    max
Sales    2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [92]:
df.groupby('Company').describe().transpose()['MSFT']

       count   mean         std    min    25%    50%    75%    max
Sales    2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

Concatenaciones

In [94]:
df1 = pd.DataFrame({'A':['A0', 'A1', 'A2','A3'],
                    'B':['B0', 'B1', 'B2','B3'],
                    'C':['C0', 'C1', 'C2','C3'],
                    'D':['D0', 'D1', 'D2','D3']},
                   index = [0,1,2,3])

In [95]:
df2 = pd.DataFrame({'A':['A4', 'A5', 'A6','A7'],
                    'B':['B4', 'B5', 'B6','B7'],
                    'C':['C4', 'C5', 'C6','C7'],
                    'D':['D4', 'D5', 'D6','D7']},
                   index = [4,5,6,7])

In [96]:
df3 = pd.DataFrame({'A':['A8', 'A9', 'A10','A11'],
                    'B':['B8', 'B9', 'B10','B11'],
                    'C':['C8', 'C9', 'C10','C11'],
                    'D':['D8', 'D9', 'D10','D11']},
                   index = [8,9,10,11])

In [97]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [98]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [99]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [100]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [102]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [103]:
izquierdo = pd.DataFrame({'Key':['K0', 'K1', 'K2', 'K3'],
                          'A':['A0', 'A1', 'A2', 'A3'],
                          'B':['B0', 'B1', 'B2', 'B3']})

In [104]:
derecho = pd.DataFrame({'Key':['K0', 'K1', 'K2', 'K3'],
                          'C':['C0', 'C1', 'C2', 'C3'],
                          'D':['D0', 'D1', 'D2', 'D3']})

Merge

In [106]:
pd.merge(izquierdo, derecho, how='inner', on='Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [109]:
izquierdo = pd.DataFrame({
                          'A':['A0', 'A1', 'A2'],
                          'B':['B0', 'B1', 'B2']},
                           index=['K0','K1', 'K2'])

In [110]:
derecho = pd.DataFrame({
                          'C':['C0', 'C1', 'C2'],
                          'D':['D0', 'D1', 'D2']},
                           index=['K0','K2', 'K3'])

In [111]:
izquierdo.join(derecho)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

Operaciones

In [113]:
df = pd.DataFrame({'col':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [114]:
df.head

<bound method DataFrame.head of    col  col2 col3
0    1   444  abc
1    2   555  def
2    3   666  ghi
3    4   444  xyz>

In [115]:
df

   col  col2 col3
0    1   444  abc
1    2   555  def
2    3   666  ghi
3    4   444  xyz

In [116]:
df.head

<bound method DataFrame.head of    col  col2 col3
0    1   444  abc
1    2   555  def
2    3   666  ghi
3    4   444  xyz>

In [119]:
df['col2'].unique()

array([444, 555, 666])

In [121]:
len(df['col2'].unique())

3

In [125]:
df['col2'].nunique()

3

In [126]:
df

   col  col2 col3
0    1   444  abc
1    2   555  def
2    3   666  ghi
3    4   444  xyz

In [130]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [131]:
def multiplitca2(x):
    return x*2

In [138]:
df.apply(multiplitca2)

   col  col2    col3
0    2   888  abcabc
1    4  1110  defdef
2    6  1332  ghighi
3    8   888  xyzxyz

In [139]:
df.apply(lambda x: x*2)

   col  col2    col3
0    2   888  abcabc
1    4  1110  defdef
2    6  1332  ghighi
3    8   888  xyzxyz